       IDENTIFICATION DIVISION.
       PROGRAM-ID. Counts.

       DATA DIVISION.
       WORKING-STORAGE SECTION.

       01 COUNTUP PIC 9(2) VALUE 0.
       01 COUNTDOWN PIC 9(2) VALUE 20.

       PROCEDURE DIVISION.
           PERFORM COUNT_UP.
           PERFORM COUNT_DOWN.
           STOP RUN.

       COUNT_UP.
           PERFORM UNTIL COUNTUP >= 20
           ADD 1 TO COUNTUP
           DISPLAY "CURRENT COUNT : " COUNTUP
           END-PERFORM.

       COUNT_DOWN.
           PERFORM UNTIL COUNTDOWN <= 0
           DISPLAY "CURRENT COUNT : " COUNTDOWN
           SUBTRACT 1 FROM COUNTDOWN
           END-PERFORM.
