       IDENTIFICATION DIVISION.
       PROGRAM-ID. FILE-HANDLER.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT EMPLOYEE-FILE ASSIGN TO "employee.dat"
           ORGANIZATION IS LINE SEQUENTIAL
           ACCESS MODE IS sequential
           FILE STATUS IS FILE-STATUS.

       DATA DIVISION.
       FILE SECTION.
       FD EMPLOYEE-FILE.
       01 EMPLOYEE-RECORD.
           05 EMPLOYEE-NAME PIC A(30).
           05 EMPLOYEE-SALARY PIC 9(6)V99.
       
       WORKING-STORAGE SECTION.

       01 FILE-STATUS PIC xx.
       01 WS-NAME PIC A(30).
       01 WS-SALARY PIC 9(6)V99.